# indexing and the conditional selection in the Series 

import pandas as pd

s1=pd.Series([23,34,44,24,56,78,],index='a','v','d','f','t')

print(p1)

In [580]:
# indexing and the conditional selection in the Series 
import matplotlib.pyplot as plt
import pandas as pd

s1=pd.Series([23,34,44,24,56,78,],index=('a','v','d','f','t','r'))

print(s1)

print(s1[s1>50])

a    23
v    34
d    44
f    24
t    56
r    78
dtype: int64
t    56
r    78
dtype: int64

In [581]:
s1.name='something '

print(s1)

a    23
v    34
d    44
f    24
t    56
r    78
Name: something , dtype: int64

In [582]:
# creating the Series from the already created Series 


s2=pd.Series(s1,('a','f'))
print(s2)

a    23
f    24
Name: something , dtype: int64

In [583]:
# we can still use or access the any value by using the indexes bu using the "iloc" keyword

print(s1.iloc[2:5])



# this gives the result in the format such that first selected rows gets displayed 
# we can access any particular rows or the set of rows by using "iloc" function 
# this fucntion is use when we dont know the what indexes are use for the indexing ......

d    44
f    24
t    56
Name: something , dtype: int64

In [584]:
s1[1:6]

v    34
d    44
f    24
t    56
r    78
Name: something , dtype: int64

In [585]:
# we can directly do such slicing by using the slicing methods as shown above

In [586]:
# here is the conditional selecction 




s3=pd.Series([23,56,45,321,4553,789,99],index=('a','b','c','d','e','f','g'))
print(s3)



s4=pd.Series(s3[1:3])

print(s4)

print((s3 > 50))
print(s3[s3 < 50]+s3)


print("HI")

print(s3[(s3 > 100)  & (s3 < 50)])



s3[s3>100]="MAX"

print(s3)

a      23
b      56
c      45
d     321
e    4553
f     789
g      99
dtype: int64
b    56
c    45
dtype: int64
a    False
b     True
c    False
d     True
e     True
f     True
g     True
dtype: bool
a    46.0
b     NaN
c    90.0
d     NaN
e     NaN
f     NaN
g     NaN
dtype: float64
HI
Series([], dtype: int64)
a     23
b     56
c     45
d    MAX
e    MAX
f    MAX
g     99
dtype: object

In [587]:

#print("HI")

#print(s3[(s3 > 100)  & (s3 < 50)])


s3=pd.Series([23,56,45,321,4553,789,99],index=('a','b','c','d','e','f','g'))
s3[s3 > 100]="max"

print(s3)

a     23
b     56
c     45
d    max
e    max
f    max
g     99
dtype: object

In [588]:
l1=[]

for i in range(5):
    
   l1.append(i*i)
    
    
l2=[]

for i in range(5):
    l2.append(i*i*i)
    
    

s4=pd.Series(l1,index=(l2))


print(s4)

print("THE MEAN IS :" ,s4.mean())

print("the standard deviation is :",s4.std())
print("THE MEDIAN IS ",s4.median())

0      0
1      1
8      4
27     9
64    16
dtype: int64
THE MEAN IS : 6.0
the standard deviation is : 6.59545297913646
THE MEDIAN IS  4.0

In [589]:
l3=[0]*10

l4=[0]*10
print(l3)


for i in range(10):
    l3[i]=i
    
    
for i in range(10):
    l4[i]=l3[i]*l3[i]
    
    
    
    
s5=pd.Series(l3,index=(l4))


print(s5)

[0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
0     0
1     1
4     2
9     3
16    4
25    5
36    6
49    7
64    8
81    9
dtype: int64

# DATAFRAMES

In [590]:
li1=[0]*10
li2=[0]*10
li3=[0]*10
li4=[0]*10
li5=[0]*10
for i in range(10):
    li1[i]=i
    
    
for i in range(10):
    li2[i]=i*2
    
for i in range(10):
        li3[i]=i*3
    
for i in range(10):
        li4[i]=i*4
        
for i in range(10):
    li5[i]=i,"p"
    
print(li1)
print(li2)
print(li3)
print(li4)

    

d1=pd.DataFrame({'Sr.no' :li1 ,'Name':li2 ,'marks':li3,'scores':li4}, index=li5)

print(d1)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
[0, 3, 6, 9, 12, 15, 18, 21, 24, 27]
[0, 4, 8, 12, 16, 20, 24, 28, 32, 36]
        Sr.no  Name  marks  scores
(0, p)      0     0      0       0
(1, p)      1     2      3       4
(2, p)      2     4      6       8
(3, p)      3     6      9      12
(4, p)      4     8     12      16
(5, p)      5    10     15      20
(6, p)      6    12     18      24
(7, p)      7    14     21      28
(8, p)      8    16     24      32
(9, p)      9    18     27      36

In [591]:

# Dataframe methods 


d1.size

40

In [592]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, (0, 'p') to (9, 'p')
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sr.no   10 non-null     int64
 1   Name    10 non-null     int64
 2   marks   10 non-null     int64
 3   scores  10 non-null     int64
dtypes: int64(4)
memory usage: 400.0+ bytes

In [593]:
d1.index

Index([(0, 'p'), (1, 'p'), (2, 'p'), (3, 'p'), (4, 'p'), (5, 'p'), (6, 'p'),
       (7, 'p'), (8, 'p'), (9, 'p')],
      dtype='object')

In [594]:

d1.shape

(10, 4)

In [595]:
d1.describe()

          Sr.no       Name      marks     scores
count  10.00000  10.000000  10.000000  10.000000
mean    4.50000   9.000000  13.500000  18.000000
std     3.02765   6.055301   9.082951  12.110601
min     0.00000   0.000000   0.000000   0.000000
25%     2.25000   4.500000   6.750000   9.000000
50%     4.50000   9.000000  13.500000  18.000000
75%     6.75000  13.500000  20.250000  27.000000
max     9.00000  18.000000  27.000000  36.000000

In [596]:



li1=[0]*10
li2=[0]*10
li3=[0]*10
li4=[0]*10
li5=[0]*10
for i in range(10):
    li1[i]=i
    
    
for i in range(10):
    li2[i]=i*2
    
for i in range(10):
        li3[i]=i*3
    
for i in range(10):
        li4[i]=i*4
        
for i in range(10):
    li5[i]=i,"p"
    
print(li1)
print(li2)
print(li3)
print(li4)

    

d1=pd.DataFrame({'Sr.no' :li1 ,'Name':li2 ,'marks':li3,'scores':li4}, index=li5)

print(d1)

#d1.loc['(0, 5)']

d1.iloc[2]
d1['marks']

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
[0, 3, 6, 9, 12, 15, 18, 21, 24, 27]
[0, 4, 8, 12, 16, 20, 24, 28, 32, 36]
        Sr.no  Name  marks  scores
(0, p)      0     0      0       0
(1, p)      1     2      3       4
(2, p)      2     4      6       8
(3, p)      3     6      9      12
(4, p)      4     8     12      16
(5, p)      5    10     15      20
(6, p)      6    12     18      24
(7, p)      7    14     21      28
(8, p)      8    16     24      32
(9, p)      9    18     27      36

(0, p)     0
(1, p)     3
(2, p)     6
(3, p)     9
(4, p)    12
(5, p)    15
(6, p)    18
(7, p)    21
(8, p)    24
(9, p)    27
Name: marks, dtype: int64

In [597]:
d1.iloc[2]

Sr.no     2
Name      4
marks     6
scores    8
Name: (2, p), dtype: int64

In [598]:
names=['h1','h2','h3','h4']


si1=pd.Series([234,5454,653,7675],index=names)

di1=pd.DataFrame({'hlll1':[2,342,56,74],'hlll2':[5473,6537,256254,75],'hlll3':[34215,453634,856,98],'hlll4':[3241,653333,76567,748786]},index=names)



print(di1)

di1['si1']=si1

print(di1)

    hlll1   hlll2   hlll3   hlll4
h1      2    5473   34215    3241
h2    342    6537  453634  653333
h3     56  256254     856   76567
h4     74      75      98  748786
    hlll1   hlll2   hlll3   hlll4   si1
h1      2    5473   34215    3241   234
h2    342    6537  453634  653333  5454
h3     56  256254     856   76567   653
h4     74      75      98  748786  7675

In [599]:
# pandas column creating by usig previous columns 
'''
l=[0]*5

for i in range(5):
    l[i]=i*i
    
    '''
    
l=[i*i for i in range(5)]


dl1=pd.DataFrame({'names':["p1","p2","p3","p4","p5"],'value':[1,2,3,4,5],'marks':[23,34,54,57,567],'score':[342,56265,265652,6234,774]},index=l)
print(dl1)

dl1['data=marks/value']=dl1['marks']/dl1['value']

print(dl1)

   names  value  marks   score
0     p1      1     23     342
1     p2      2     34   56265
4     p3      3     54  265652
9     p4      4     57    6234
16    p5      5    567     774
   names  value  marks   score  data=marks/value
0     p1      1     23     342             23.00
1     p2      2     34   56265             17.00
4     p3      3     54  265652             18.00
9     p4      4     57    6234             14.25
16    p5      5    567     774            113.40

In [600]:
# some important   statastical  methods

In [601]:
dl1.describe()

          value       marks          score  data=marks/value
count  5.000000    5.000000       5.000000          5.000000
mean   3.000000  147.000000   65853.400000         37.130000
std    1.581139  235.209481  114119.414066         42.753474
min    1.000000   23.000000     342.000000         14.250000
25%    2.000000   34.000000     774.000000         17.000000
50%    3.000000   54.000000    6234.000000         18.000000
75%    4.000000   57.000000   56265.000000         23.000000
max    5.000000  567.000000  265652.000000        113.400000

In [602]:
dl1.min()

dl1.loc[len(dl1)]=dl1.min()

#dl1.loc[len(dl1)]=dl1({},index="min")
print(dl1)

   names  value  marks   score  data=marks/value
0     p1      1     23     342             23.00
1     p2      2     34   56265             17.00
4     p3      3     54  265652             18.00
9     p4      4     57    6234             14.25
16    p5      5    567     774            113.40
5     p1      1     23     342             14.25

In [603]:
dl1.max()

dl1.loc[len(dl1)]=dl1.max()
print(dl1)

   names  value  marks   score  data=marks/value
0     p1      1     23     342             23.00
1     p2      2     34   56265             17.00
4     p3      3     54  265652             18.00
9     p4      4     57    6234             14.25
16    p5      5    567     774            113.40
5     p1      1     23     342             14.25
6     p5      5    567  265652            113.40

In [604]:
dl1.sum()











dl1.loc[len(dl1)]=dl1.sum()
print(dl1)

             names  value  marks   score  data=marks/value
0               p1      1     23     342             23.00
1               p2      2     34   56265             17.00
4               p3      3     54  265652             18.00
9               p4      4     57    6234             14.25
16              p5      5    567     774            113.40
5               p1      1     23     342             14.25
6               p5      5    567  265652            113.40
7   p1p2p3p4p5p1p5     21   1325  595261            313.30

In [605]:
dl1.mean()

C:\Users\pavan\AppData\Local\Temp\ipykernel_14668\275254369.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dl1.mean()

value                    5.250
marks                  331.250
score               148815.250
data=marks/value        78.325
dtype: float64

In [606]:
dl1.median()

C:\Users\pavan\AppData\Local\Temp\ipykernel_14668\1712983983.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dl1.median()

value                   3.5
marks                  55.5
score               31249.5
data=marks/value       20.5
dtype: float64

In [607]:
dl1.std()

C:\Users\pavan\AppData\Local\Temp\ipykernel_14668\3766234008.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dl1.std()

value                    6.562883
marks                  467.389330
score               214314.603613
data=marks/value       104.434320
dtype: float64

In [608]:
dl1.quantile()

C:\Users\pavan\AppData\Local\Temp\ipykernel_14668\2989543078.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  dl1.quantile()

value                   3.5
marks                  55.5
score               31249.5
data=marks/value       20.5
Name: 0.5, dtype: float64

In [609]:
## reading the data from the external sources 

f1=pd.read_csv('Business-employment-data-september-2022-quarter-csv.csv')
print(f1)

                 SERIAL     TIME       MARKS        SOME  RESULT   QUANT  \
0      Series_reference   Period  Data_value  Suppressed  STATUS   UNITS
1           BDCQ.SEA1AA  2011.06       80078         NaN       F  Number
2           BDCQ.SEA1AA  2011.09       78324         NaN       F  Number
3           BDCQ.SEA1AA  2011.12       85850         NaN       F  Number
4           BDCQ.SEA1AA  2012.03       90743         NaN       F  Number
...                 ...      ...         ...         ...     ...     ...
20637     BDCQ.SEE3999A  2017.06         NaN           Y       C  Number
20638     BDCQ.SEE3999A  2017.09         NaN           Y       C  Number
20639     BDCQ.SEE3999A  2017.12         NaN           Y       C  Number
20640     BDCQ.SEE3999A  2018.03         NaN           Y       C  Number
20641     BDCQ.SEE3999A  2018.06         NaN           Y       C  Number

           SCORE                      SPECIALITY  \
0      Magnitude                         Subject
1              0  Business Data Collection - BDC
2              0  Business Data Collection - BDC
3              0  Business Data Collection - BDC
4              0  Business Data Collection - BDC
...          ...                             ...
20637          0  Business Data Collection - BDC
20638          0  Business Data Collection - BDC
20639          0  Business Data Collection - BDC
20640          0  Business Data Collection - BDC
20641          0  Business Data Collection - BDC

                                               TEAM  \
0                                             Group
1                   Industry by employment variable
2                   Industry by employment variable
3                   Industry by employment variable
4                   Industry by employment variable
...                                             ...
20637  Territorial authority by employment variable
20638  Territorial authority by employment variable
20639  Territorial authority by employment variable
20640  Territorial authority by employment variable
20641  Territorial authority by employment variable

                                         TAGS  \
0                              Series_title_1
1                                 Filled jobs
2                                 Filled jobs
3                                 Filled jobs
4                                 Filled jobs
...                                       ...
20637  Filled jobs (workplace location based)
20638  Filled jobs (workplace location based)
20639  Filled jobs (workplace location based)
20640  Filled jobs (workplace location based)
20641  Filled jobs (workplace location based)

                               DEPARTMENT           STATE     Unnamed: 12  \
0                          Series_title_2  Series_title_3  Series_title_4
1       Agriculture, Forestry and Fishing          Actual             NaN
2       Agriculture, Forestry and Fishing          Actual             NaN
3       Agriculture, Forestry and Fishing          Actual             NaN
4       Agriculture, Forestry and Fishing          Actual             NaN
...                                   ...             ...             ...
20637  Area Outside Territorial Authority          Actual             NaN
20638  Area Outside Territorial Authority          Actual             NaN
20639  Area Outside Territorial Authority          Actual             NaN
20640  Area Outside Territorial Authority          Actual             NaN
20641  Area Outside Territorial Authority          Actual             NaN

          Unnamed: 13
0      Series_title_5
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
20637             NaN
20638             NaN
20639             NaN
20640             NaN
20641             NaN

[20642 rows x 14 columns]

In [610]:
print(f1.head())

             SERIAL     TIME       MARKS        SOME  RESULT   QUANT  \
0  Series_reference   Period  Data_value  Suppressed  STATUS   UNITS
1       BDCQ.SEA1AA  2011.06       80078         NaN       F  Number
2       BDCQ.SEA1AA  2011.09       78324         NaN       F  Number
3       BDCQ.SEA1AA  2011.12       85850         NaN       F  Number
4       BDCQ.SEA1AA  2012.03       90743         NaN       F  Number

       SCORE                      SPECIALITY                             TEAM  \
0  Magnitude                         Subject                            Group
1          0  Business Data Collection - BDC  Industry by employment variable
2          0  Business Data Collection - BDC  Industry by employment variable
3          0  Business Data Collection - BDC  Industry by employment variable
4          0  Business Data Collection - BDC  Industry by employment variable

             TAGS                         DEPARTMENT           STATE  \
0  Series_title_1                     Series_title_2  Series_title_3
1     Filled jobs  Agriculture, Forestry and Fishing          Actual
2     Filled jobs  Agriculture, Forestry and Fishing          Actual
3     Filled jobs  Agriculture, Forestry and Fishing          Actual
4     Filled jobs  Agriculture, Forestry and Fishing          Actual

      Unnamed: 12     Unnamed: 13
0  Series_title_4  Series_title_5
1             NaN             NaN
2             NaN             NaN
3             NaN             NaN
4             NaN             NaN

In [611]:
f1.shape

(20642, 14)

In [612]:
f1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20642 entries, 0 to 20641
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SERIAL       20642 non-null  object
 1   TIME         20642 non-null  object
 2   MARKS        16147 non-null  object
 3    SOME        2840 non-null   object
 4   RESULT       20642 non-null  object
 5   QUANT        20642 non-null  object
 6   SCORE        20642 non-null  object
 7   SPECIALITY   20642 non-null  object
 8   TEAM         20642 non-null  object
 9   TAGS         20642 non-null  object
 10  DEPARTMENT   20642 non-null  object
 11  STATE        20642 non-null  object
 12  Unnamed: 12  1 non-null      object
 13  Unnamed: 13  1 non-null      object
dtypes: object(14)
memory usage: 2.2+ MB

In [613]:
f1.sum()

C:\Users\pavan\AppData\Local\Temp\ipykernel_14668\756431700.py:1: FutureWarning: The default value of numeric_only in DataFrame.sum is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  f1.sum()

SERIAL        Series_referenceBDCQ.SEA1AABDCQ.SEA1AABDCQ.SEA...
TIME          Period2011.062011.092011.122012.032012.062012....
RESULT        STATUSFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF...
QUANT         UNITSNumberNumberNumberNumberNumberNumberNumbe...
SCORE         Magnitude0000000000000000000000000000000000000...
SPECIALITY    SubjectBusiness Data Collection - BDCBusiness ...
TEAM          GroupIndustry by employment variableIndustry b...
TAGS          Series_title_1Filled jobsFilled jobsFilled job...
DEPARTMENT    Series_title_2Agriculture, Forestry and Fishin...
STATE         Series_title_3ActualActualActualActualActualAc...
dtype: object

In [614]:
f1.describe()

,SERIAL,TIME,MARKS,SOME,RESULT,QUANT,SCORE,SPECIALITY,TEAM,TAGS,DEPARTMENT,STATE,Unnamed: 12,Unnamed: 13
count,20642,20642,16147,2840,20642,20642,20642,20642,20642,20642,20642,20642,1,1
unique,463,47,14447,2,4,3,3,2,6,4,117,4,1,1
top,BDCQ.SED2RMA,2012.09,12459,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs,Auckland,Actual,Series_title_4,Series_title_5
freq,46,462,5,2839,14630,12496,12496,20641,9277,8649,446,14521,1,1

In [615]:
f1.head()

,SERIAL,TIME,MARKS,SOME,RESULT,QUANT,SCORE,SPECIALITY,TEAM,TAGS,DEPARTMENT,STATE,Unnamed: 12,Unnamed: 13
0,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
1,BDCQ.SEA1AA,2011.06,80078,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.09,78324,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2011.12,85850,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.03,90743,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [618]:

f1.plot()

TypeError: no numeric data to plot